src/emacs/org-mode/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-07-17 Tue 11:10 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacsを使う最大の理由！文書作成のすべてをorg-modeで記述しよう！</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Naoya Yamashita" />
</head>
<body>
<div id="content">
<h1 class="title">Emacsを使う最大の理由！文書作成のすべてをorg-modeで記述しよう！</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org60a9456">1. 環境</a></li>
<li><a href="#orgcbfd758">2. はじめに</a></li>
<li><a href="#org662f313">3. インストール</a></li>
<li><a href="#orgb19e83f">4. org-modeカテゴリ</a></li>
</ul>
</div>
</div>
<p>
Emacsを使う理由は様々あると思いますが、私がEmacsを使う最大の理由は <b>org-modeが使えること</b> です。
会議の議事録や、規約の編集、卒業論文まで全ての文書作成をorg-modeで行うことができます。
</p>

<div id="outline-container-org60a9456" class="outline-2">
<h2 id="org60a9456"><span class="section-number-2">1</span> 環境</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="../emacs/index.html">Emacs - 25.3.1</a>
<ul class="org-ul">
<li><a href="../use-package.html">use-package - 2.4</a></li>
<li>org-mode - 9.1.13</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgcbfd758" class="outline-2">
<h2 id="orgcbfd758"><span class="section-number-2">2</span> はじめに</h2>
<div class="outline-text-2" id="text-2">
<p>
org-modeで記述する利点としては、プレーンテキストで文書を作成するため <b>diffがみやすくなる</b> という点があります。
最近ではWardのようなリッチ文書作成ソフトでもdiffを取りやすくなっているようですが、プレーンテキストにはかないません。
git管理することで、その文書を <b>誰が</b>, <b>いつ</b> 書き換えたのか明白に管理できますし、巻き戻しも容易です。
コミットメッセージを活用することで <b>なぜ</b> 書き換えたのかも管理できます。
</p>

<p>
そうした「管理された文書」を思い通りの形式に <b>変換して出力</b> できます。
例に挙げた会議の議事録や、規約の編集は所属していた交響楽団に関するものでした。
もちろん団員はEmacsをインストールしていないため、純粋なプレーンテキストとしてのorg-modeは理解しづらいですが、
<b>HTMLに出力して印刷し配布</b> しましたし、後輩には <b>Word形式</b> で引き継ぐことができました。
</p>

<p>
卒業論文はもちろん <b>LaTeX</b> での提出が求められます。この要求に対してもorg-modeは十二分に応えてくれます。
なぜならorg-modeの文法は簡潔で <b>執筆に集中できる</b> 上に、 <b>編集のためのお助け機能</b> をorg-modeが提供してくれているからです。
</p>

<p>
ここだけの話ですが、HTMLやLaTeXは <b>人間が書くものじゃない</b> と個人的に考えています。
HTMLはZen Codingなどのお助け機能やLaTeXもEmacsではYaTeXなどのお助け機能がありますが、根本的に <b>人間が書くフォーマットじゃない</b> んです。
</p>

<p>
その点org-modeを使えば執筆に集中でき、難しい構造を隠してくれる上に、 <b>多彩なフォーマットに出力</b> できるのです。
もう人類はHTMLタグやLaTeX環境、通常マークダウンとQiita記法やはてな記法の違いなどに頭を悩ますことはないのです。
なぜならorg-mode記法で一回書けば全て変換できるからです！
</p>

<p>
ちょっと話が大きくなりましたが、本心です。そして私がorg-modeに出会ったときの衝撃です。
ちなみにEmacsは気難しいやつで当時何度も挫折していた頃でしたが、 <b>org-modeを使うため</b> にEmacsと仲良くなって
今ではEmacsで全てのプログラミング、文書作成を行っています笑
</p>
</div>
</div>
<div id="outline-container-org662f313" class="outline-2">
<h2 id="org662f313"><span class="section-number-2">3</span> インストール</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>org-modeのインストール</label><pre class="src src-elisp" id="orgee5b58d">(<span class="org-keyword">require</span> '<span class="org-constant">package</span>)
(<span class="org-keyword">when</span> (not (package-installed-p 'use-package))
  (package-refresh-contents)
  (package-install 'use-package))
(<span class="org-keyword">use-package</span> <span class="org-constant">org</span> <span class="org-builtin">:ensure</span> t <span class="org-builtin">:defer</span> t
  <span class="org-builtin">:bind</span> ((<span class="org-string">"C-c o l"</span> . org-store-link)
         (<span class="org-string">"C-c o a"</span> . org-agenda)
         (<span class="org-string">"C-c o c"</span> . org-capture)
         (<span class="org-string">"C-c o b"</span> . org-iswitchb))
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">setq</span> org-src-window-setup     'other-window
        org-use-sub-superscripts '{}))
</pre>
</div>
<p>
上記はgithubで<a href="https://github.com/conao/dotfiles">公開</a>してる.emacs.dからの抜粋です。
<code>"use-package org"</code> と検索して実際のコードを見てみるといいかも知れません。
</p>
</div>
</div>
<div id="outline-container-orgb19e83f" class="outline-2">
<h2 id="orgb19e83f"><span class="section-number-2">4</span> org-modeカテゴリ</h2>
<div class="outline-text-2" id="text-4">
<p>
org-modeは巨大で、関連するパッケージも多いため小記事に分けます。
</p>
<ul class="org-ul">
<li><a href="./basis-syntax.html">org-mode基本文法</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2018-07-17 Tue 09:30</p>
<p class="author">Author: Naoya Yamashita</p>
<p class="date">Created: 2018-07-17 Tue 11:10</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
